[
  {
    "id": 1,
    "name": "Street Tech",
    "photo": "/assets/StreetTech.PNG",
    "linkUrl": "https://next-js-loja-roupas.vercel.app/",
    "description": "Este projeto, desenvolvido para uma loja de roupas fictícia, utiliza um banco de dados local para gerenciar o estoque e as informações dos produtos. Com foco na experiência do usuário, o projeto implementa funcionalidades de filtragem e categorização de produtos, utilizando os métodos .map e .filter para otimizar a navegação e a busca por itens específicos.",
    "subDescription": "A aplicação permite que os clientes explorem as diferentes categorias de roupas, filtradas por estilos, proporcionando uma experiência de compra personalizada e eficiente."
  },
  {
    "id": 2,
    "name": "Marvel Api",
    "photo": "/assets/MarvelApi.PNG",
    "linkUrl": "https://next-js-marvel-api.vercel.app/",
    "description": "Neste projeto, construi um banco de dados completo dos personagens da Marvel, utilizando a API oficial da Marvel. O projeto se baseia no método fetch para se conectar à API, coletando informações detalhadas sobre personagens, HQs e arcos narrativos.",
    "subDescription": "Este projeto é uma ótima ferramenta para fãs da Marvel que desejam mergulhar no universo dos quadrinhos e aprender mais sobre seus personagens favoritos"
  },
  {
    "id": 3,
    "name": "Clone Casas Bahia",
    "photo": "/assets/CasasBahia.PNG",
    "linkUrl": "https://next-clone-casas-bahia.vercel.app/",
    "description": "Neste projeto, foi feito um clone de uma página das Casas bahia, utilizando um banco de dados local, foi usado o método de .map.",
    "subDescription": ""
  },
  {
    "id": 4,
    "name": "Sistema Solar",
    "photo": "/assets/Sistem.PNG",
    "linkUrl": "https://sistema-solar-v1.vercel.app/",
    "description": "Projeto simples do sistema solar, foi utilizado apenas CSS puro para a realização do mesmo.",
    "subDescription": ""
  },
  {
    "id": 5,
    "name": "GitHub Search",
    "photo": "/assets/GitHubSearch.PNG",
    "linkUrl": "https://react-typescript-api-github.vercel.app/",
    "description": "Neste projeto, utilizo a api oficial do GitHub para fazer buscas por usuários e suas respectivas informações.",
    "subDescription": ""
  },
  {
    "id": 6,
    "name": "React Login",
    "photo": "/assets/ReactLogin.PNG",
    "linkUrl": "https://react-login-gilt.vercel.app/",
    "description": "Neste projeto, crio uma interface simples e intuitiva para a realização de um login em um site fictício.",
    "subDescription": ""
  },
  {
    "id": 7,
    "name": "Relógio CSS - JS",
    "photo": "/assets/Relógio.PNG",
    "linkUrl": "https://relogio-digital-beige.vercel.app/",
    "description": "Neste projeto, crio um relógio digital utilizando JavaScript e CSS.",
    "subDescription": ""
  }
]